# Dotfiles Brewfile
# Install with: brew bundle --file=~/.dotfiles/Brewfile

# Binaries
brew "ffmpeg"
brew "git"

# Spatie Medialibrary
brew "jpegoptim"
brew "optipng"
brew "pngquant"
brew "svgo"
brew "gifsicle"

# Core tools
brew "herd"
brew "node"
brew "composer"
brew "pkg-config"
brew "wget"
brew "httpie"
brew "ncdu"
brew "hub"
brew "gh"
brew "ack"
brew "doctl"
brew "git-secret"
brew "imagemagick"
brew "libmemcached"
brew "memcached"
brew "mysql@8.4"
brew "redis"
brew "yarn"
brew "ghostscript"
brew "mackup"

# Zsh
brew "zsh-autosuggestions"

# Modern CLI tools
brew "starship"
brew "zoxide"
brew "bat"
brew "eza"
brew "ripgrep"
brew "fd"
brew "git-delta"
brew "fnm"
brew "fzf"
brew "direnv"
brew "jq"
brew "yq"
brew "bottom"

# Development tools
cask "claude-code"
cask "zed"

# Fonts
cask "font-meslo-lg-nerd-font"

# QuickLook plugins
cask "qlcolorcode"
cask "qlstephen"
cask "qlmarkdown"
cask "quicklook-json"
cask "qlprettypatch"
cask "quicklook-csv"
cask "betterzip"
cask "suspicious-package"

# Apps
brew "deepl"
brew "dropbox"
brew "f-bar"
brew "figma"
brew "firefox"
brew "github"
brew "google-chrome"
brew "handbrake"
brew "mole"
brew "optimage"
brew "insomnia"
brew "iterm2"
brew "mas"
brew "microsoft-teams"
brew "nordvpn"
brew "raycast"
brew "sequel-ace"
brew "sf-symbols"
brew "sketch"
brew "slack"
brew "sitesucker-pro"
brew "sublime-text"
brew "tableplus"
brew "the-unarchiver"
brew "transmission"
brew "transmit"
brew "visual-studio-code"
brew "vlc"
brew "whatsapp"
