# Dotfiles Brewfile
# Install with: brew bundle --file=~/.dotfiles/Brewfile

# Spatie Medialibrary
brew "gifsicle"
brew "jpegoptim"
brew "optipng"
brew "pngquant"
brew "svgo"

# Core tools
brew "ack"
brew "composer"
brew "doctl"
brew "ffmpeg"
brew "gh"
brew "ghostscript"
brew "git"
brew "git-secret"
brew "httpie"
brew "hub"
brew "imagemagick"
brew "libmemcached"
brew "mackup"
brew "mas"
brew "memcached"
brew "minicodemonkey/chief/chief"
brew "mole"
brew "mysql@8.4"
brew "ncdu"
brew "node"
brew "pkg-config"
brew "redis"
brew "wget"
brew "yarn"

# Zsh
brew "zsh-autosuggestions"

# Modern CLI tools
brew "bat"
brew "bottom"
brew "direnv"
brew "eza"
brew "fd"
brew "fnm"
brew "fzf"
brew "git-delta"
brew "jq"
brew "ripgrep"
brew "starship"
brew "yq"
brew "zoxide"

# Fonts
cask "font-meslo-lg-nerd-font"

# QuickLook plugins
cask "betterzip"
cask "qlcolorcode"
cask "qlmarkdown"
cask "qlprettypatch"
cask "qlstephen"
cask "quicklook-csv"
# cask "quicklook-json"
cask "suspicious-package"

# Apps
cask "claude-code"
cask "deepl"
cask "dropbox"
cask "figma"
cask "firefox"
cask "ghostty"
cask "github"
cask "google-chrome"
cask "handbrake-app"
cask "herd"
cask "insomnia"
cask "iterm2"
cask "microsoft-teams"
cask "nordvpn"
cask "optimage"
cask "raycast"
cask "sequel-ace"
cask "sf-symbols"
cask "sitesucker-pro"
cask "sketch"
cask "slack"
cask "sublime-text"
cask "tableplus"
cask "the-unarchiver"
cask "transmission"
cask "transmit"
cask "visual-studio-code"
cask "vlc"
cask "whatsapp"
cask "zed"
