# Dotfiles Brewfile
# Install with: brew bundle --file=~/.dotfiles/Brewfile

# Spatie Medialibrary
brew 'jpegoptim'
brew 'optipng'
brew 'pngquant'
brew 'svgo'
brew 'gifsicle'

# Core tools
brew "herd"
brew "node"
brew "composer"
brew "pkg-config"
brew "wget"
brew "httpie"
brew "ncdu"
brew "hub"
brew "gh"
brew "ack"
brew "doctl"
brew "git-secret"
brew "imagemagick"
brew "mysql@8.4"
brew "yarn"
brew "ghostscript"
brew "mackup"

# Zsh
brew "zsh-autosuggestions"

# Modern CLI tools
brew "starship"
brew "zoxide"
brew "bat"
brew "eza"
brew "ripgrep"
brew "fd"
brew "git-delta"
brew "fnm"
brew "fzf"
brew "direnv"
brew "jq"
brew "yq"
brew "bottom"

# Development tools
cask "claude-code"
cask "zed"

# Fonts
cask "font-meslo-lg-nerd-font"

# QuickLook plugins
cask "qlcolorcode"
cask "qlstephen"
cask "qlmarkdown"
cask "quicklook-json"
cask "qlprettypatch"
cask "quicklook-csv"
cask "betterzip"
cask "suspicious-package"
